title: AWS Root Account Usage
status: experimental
description: Detects any usage of the AWS root account which should be reserved for emergency access only
author: Nick Langevin
date: 2026/03/13
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        userIdentity.type: Root
    filter:
        eventName: ConsoleLogin
    condition: selection and not filter
level: critical
tags:
    - attack.privilege_escalation
    - attack.t1078.004